/* automatically generated by rust-bindgen 0.65.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const _POSIX2_COLL_WEIGHTS_MAX: u32 = 2;
pub const _POSIX_RE_DUP_MAX: u32 = 255;
pub const OFF_MIN: i64 = -9223372036854775808;
pub const OFF_MAX: u64 = 9223372036854775807;
pub const PASS_MAX: u32 = 128;
pub const NL_ARGMAX: u32 = 9;
pub const NL_LANGMAX: u32 = 14;
pub const NL_MSGMAX: u32 = 32767;
pub const NL_NMAX: u32 = 1;
pub const NL_SETMAX: u32 = 255;
pub const NL_TEXTMAX: u32 = 2048;
pub const _XOPEN_IOV_MAX: u32 = 16;
pub const IOV_MAX: u32 = 1024;
pub const _XOPEN_NAME_MAX: u32 = 255;
pub const _XOPEN_PATH_MAX: u32 = 1024;
pub const LEAN_VERSION_MAJOR: u32 = 4;
pub const LEAN_VERSION_MINOR: u32 = 0;
pub const LEAN_VERSION_PATCH: u32 = 0;
pub const LEAN_VERSION_IS_RELEASE: u32 = 0;
pub const LEAN_SPECIAL_VERSION_DESC: &[u8; 19usize] = b"nightly-2023-06-10\0";
pub const LEAN_PACKAGE_VERSION: &[u8; 10usize] = b"NOT-FOUND\0";
pub const LEAN_IS_STAGE0: u32 = 0;
pub const LEAN_CLOSURE_MAX_ARGS: u32 = 16;
pub const LEAN_OBJECT_SIZE_DELTA: u32 = 8;
pub const LEAN_MAX_SMALL_OBJECT_SIZE: u32 = 4096;
pub const LeanMaxCtorTag: u32 = 244;
pub const LeanClosure: u32 = 245;
pub const LeanArray: u32 = 246;
pub const LeanStructArray: u32 = 247;
pub const LeanScalarArray: u32 = 248;
pub const LeanString: u32 = 249;
pub const LeanMPZ: u32 = 250;
pub const LeanThunk: u32 = 251;
pub const LeanTask: u32 = 252;
pub const LeanRef: u32 = 253;
pub const LeanExternal: u32 = 254;
pub const LeanReserved: u32 = 255;
pub const LEAN_MAX_CTOR_FIELDS: u32 = 256;
pub const LEAN_MAX_CTOR_SCALARS_SIZE: u32 = 1024;
pub const LEAN_MAX_SMALL_NAT: i32 = -1;
pub type wchar_t = ::core::ffi::c_int;
pub type max_align_t = f64;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type __int8_t = ::core::ffi::c_schar;
pub type __uint8_t = ::core::ffi::c_uchar;
pub type __int16_t = ::core::ffi::c_short;
pub type __uint16_t = ::core::ffi::c_ushort;
pub type __int32_t = ::core::ffi::c_int;
pub type __uint32_t = ::core::ffi::c_uint;
pub type __int64_t = ::core::ffi::c_longlong;
pub type __uint64_t = ::core::ffi::c_ulonglong;
pub type __darwin_intptr_t = ::core::ffi::c_long;
pub type __darwin_natural_t = ::core::ffi::c_uint;
pub type __darwin_ct_rune_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::core::ffi::c_char; 128usize],
    pub _mbstateL: ::core::ffi::c_longlong,
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::core::mem::MaybeUninit<__mbstate_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__mbstate8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mbstateL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(_mbstateL)
        )
    );
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::core::ffi::c_long;
pub type __darwin_size_t = ::core::ffi::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::core::ffi::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::core::ffi::c_int;
pub type __darwin_clock_t = ::core::ffi::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::core::ffi::c_long;
pub type __darwin_time_t = ::core::ffi::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::core::ffi::c_uint;
pub type __darwin_fsfilcnt_t = ::core::ffi::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::core::ffi::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::core::ffi::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub __arg: *mut ::core::ffi::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
    const UNINIT: ::core::mem::MaybeUninit<__darwin_pthread_handler_rec> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__darwin_pthread_handler_rec>(),
        24usize,
        concat!("Size of: ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        ::core::mem::align_of::<__darwin_pthread_handler_rec>(),
        8usize,
        concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__routine) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__arg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_attr_t() {
    const UNINIT: ::core::mem::MaybeUninit<_opaque_pthread_attr_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_attr_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    const UNINIT: ::core::mem::MaybeUninit<_opaque_pthread_cond_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_condattr_t() {
    const UNINIT: ::core::mem::MaybeUninit<_opaque_pthread_condattr_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_condattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_condattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    const UNINIT: ::core::mem::MaybeUninit<_opaque_pthread_mutex_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_mutex_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutexattr_t() {
    const UNINIT: ::core::mem::MaybeUninit<_opaque_pthread_mutexattr_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_mutexattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_mutexattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_once_t() {
    const UNINIT: ::core::mem::MaybeUninit<_opaque_pthread_once_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_once_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_once_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 192usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlock_t() {
    const UNINIT: ::core::mem::MaybeUninit<_opaque_pthread_rwlock_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_rwlock_t>(),
        200usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 16usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlockattr_t() {
    const UNINIT: ::core::mem::MaybeUninit<_opaque_pthread_rwlockattr_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_rwlockattr_t>(),
        24usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::core::ffi::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::core::ffi::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
    const UNINIT: ::core::mem::MaybeUninit<_opaque_pthread_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_opaque_pthread_t>(),
        8192usize,
        concat!("Size of: ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_opaque_pthread_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__cleanup_stack) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__cleanup_stack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__opaque)
        )
    );
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::core::ffi::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type u_int8_t = ::core::ffi::c_uchar;
pub type u_int16_t = ::core::ffi::c_ushort;
pub type u_int32_t = ::core::ffi::c_uint;
pub type u_int64_t = ::core::ffi::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type intmax_t = ::core::ffi::c_long;
pub type uintmax_t = ::core::ffi::c_ulong;
extern "C" {
    pub fn lean_notify_assert(
        fileName: *const ::core::ffi::c_char,
        line: ::core::ffi::c_int,
        condition: *const ::core::ffi::c_char,
    );
}
extern "C" {
    #[link_name = "lean_is_big_object_tag_rs_extern"]
    pub fn lean_is_big_object_tag(tag: u8) -> bool;
}
pub type assertion_failed___FILE___94 = [::core::ffi::c_char; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lean_object {
    pub m_rc: ::core::ffi::c_int,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_lean_object() {
    const UNINIT: ::core::mem::MaybeUninit<lean_object> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lean_object>(),
        8usize,
        concat!("Size of: ", stringify!(lean_object))
    );
    assert_eq!(
        ::core::mem::align_of::<lean_object>(),
        4usize,
        concat!("Alignment of ", stringify!(lean_object))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_rc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_object),
            "::",
            stringify!(m_rc)
        )
    );
}
impl lean_object {
    #[inline]
    pub fn m_cs_sz(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_m_cs_sz(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn m_other(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_m_other(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn m_tag(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_m_tag(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        m_cs_sz: ::core::ffi::c_uint,
        m_other: ::core::ffi::c_uint,
        m_tag: ::core::ffi::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let m_cs_sz: u32 = unsafe { ::core::mem::transmute(m_cs_sz) };
            m_cs_sz as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let m_other: u32 = unsafe { ::core::mem::transmute(m_other) };
            m_other as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let m_tag: u32 = unsafe { ::core::mem::transmute(m_tag) };
            m_tag as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type lean_obj_arg = *mut lean_object;
pub type b_lean_obj_arg = *mut lean_object;
pub type u_lean_obj_arg = *mut lean_object;
pub type lean_obj_res = *mut lean_object;
pub type b_lean_obj_res = *mut lean_object;
#[repr(C)]
#[derive(Debug)]
pub struct lean_ctor_object {
    pub m_header: lean_object,
    pub m_objs: __IncompleteArrayField<*mut lean_object>,
}
#[test]
fn bindgen_test_layout_lean_ctor_object() {
    const UNINIT: ::core::mem::MaybeUninit<lean_ctor_object> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lean_ctor_object>(),
        8usize,
        concat!("Size of: ", stringify!(lean_ctor_object))
    );
    assert_eq!(
        ::core::mem::align_of::<lean_ctor_object>(),
        8usize,
        concat!("Alignment of ", stringify!(lean_ctor_object))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_ctor_object),
            "::",
            stringify!(m_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_objs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_ctor_object),
            "::",
            stringify!(m_objs)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lean_array_object {
    pub m_header: lean_object,
    pub m_size: usize,
    pub m_capacity: usize,
    pub m_data: __IncompleteArrayField<*mut lean_object>,
}
#[test]
fn bindgen_test_layout_lean_array_object() {
    const UNINIT: ::core::mem::MaybeUninit<lean_array_object> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lean_array_object>(),
        24usize,
        concat!("Size of: ", stringify!(lean_array_object))
    );
    assert_eq!(
        ::core::mem::align_of::<lean_array_object>(),
        8usize,
        concat!("Alignment of ", stringify!(lean_array_object))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_array_object),
            "::",
            stringify!(m_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_array_object),
            "::",
            stringify!(m_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_array_object),
            "::",
            stringify!(m_capacity)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_data) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_array_object),
            "::",
            stringify!(m_data)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lean_sarray_object {
    pub m_header: lean_object,
    pub m_size: usize,
    pub m_capacity: usize,
    pub m_data: __IncompleteArrayField<u8>,
}
#[test]
fn bindgen_test_layout_lean_sarray_object() {
    const UNINIT: ::core::mem::MaybeUninit<lean_sarray_object> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lean_sarray_object>(),
        24usize,
        concat!("Size of: ", stringify!(lean_sarray_object))
    );
    assert_eq!(
        ::core::mem::align_of::<lean_sarray_object>(),
        8usize,
        concat!("Alignment of ", stringify!(lean_sarray_object))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_sarray_object),
            "::",
            stringify!(m_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_sarray_object),
            "::",
            stringify!(m_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_sarray_object),
            "::",
            stringify!(m_capacity)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_data) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_sarray_object),
            "::",
            stringify!(m_data)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lean_string_object {
    pub m_header: lean_object,
    pub m_size: usize,
    pub m_capacity: usize,
    pub m_length: usize,
    pub m_data: __IncompleteArrayField<::core::ffi::c_char>,
}
#[test]
fn bindgen_test_layout_lean_string_object() {
    const UNINIT: ::core::mem::MaybeUninit<lean_string_object> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lean_string_object>(),
        32usize,
        concat!("Size of: ", stringify!(lean_string_object))
    );
    assert_eq!(
        ::core::mem::align_of::<lean_string_object>(),
        8usize,
        concat!("Alignment of ", stringify!(lean_string_object))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_string_object),
            "::",
            stringify!(m_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_string_object),
            "::",
            stringify!(m_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_string_object),
            "::",
            stringify!(m_capacity)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_length) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_string_object),
            "::",
            stringify!(m_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_data) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_string_object),
            "::",
            stringify!(m_data)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct lean_closure_object {
    pub m_header: lean_object,
    pub m_fun: *mut ::core::ffi::c_void,
    pub m_arity: u16,
    pub m_num_fixed: u16,
    pub m_objs: __IncompleteArrayField<*mut lean_object>,
}
#[test]
fn bindgen_test_layout_lean_closure_object() {
    const UNINIT: ::core::mem::MaybeUninit<lean_closure_object> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lean_closure_object>(),
        24usize,
        concat!("Size of: ", stringify!(lean_closure_object))
    );
    assert_eq!(
        ::core::mem::align_of::<lean_closure_object>(),
        8usize,
        concat!("Alignment of ", stringify!(lean_closure_object))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_closure_object),
            "::",
            stringify!(m_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_fun) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_closure_object),
            "::",
            stringify!(m_fun)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_arity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_closure_object),
            "::",
            stringify!(m_arity)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_num_fixed) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_closure_object),
            "::",
            stringify!(m_num_fixed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_objs) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_closure_object),
            "::",
            stringify!(m_objs)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lean_ref_object {
    pub m_header: lean_object,
    pub m_value: *mut lean_object,
}
#[test]
fn bindgen_test_layout_lean_ref_object() {
    const UNINIT: ::core::mem::MaybeUninit<lean_ref_object> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lean_ref_object>(),
        16usize,
        concat!("Size of: ", stringify!(lean_ref_object))
    );
    assert_eq!(
        ::core::mem::align_of::<lean_ref_object>(),
        8usize,
        concat!("Alignment of ", stringify!(lean_ref_object))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_ref_object),
            "::",
            stringify!(m_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_ref_object),
            "::",
            stringify!(m_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lean_thunk_object {
    pub m_header: lean_object,
    pub m_value: *mut lean_object,
    pub m_closure: *mut lean_object,
}
#[test]
fn bindgen_test_layout_lean_thunk_object() {
    const UNINIT: ::core::mem::MaybeUninit<lean_thunk_object> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lean_thunk_object>(),
        24usize,
        concat!("Size of: ", stringify!(lean_thunk_object))
    );
    assert_eq!(
        ::core::mem::align_of::<lean_thunk_object>(),
        8usize,
        concat!("Alignment of ", stringify!(lean_thunk_object))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_thunk_object),
            "::",
            stringify!(m_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_thunk_object),
            "::",
            stringify!(m_value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_closure) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_thunk_object),
            "::",
            stringify!(m_closure)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lean_task_imp {
    pub m_closure: *mut lean_object,
    pub m_head_dep: *mut lean_task,
    pub m_next_dep: *mut lean_task,
    pub m_prio: ::core::ffi::c_uint,
    pub m_canceled: u8,
    pub m_keep_alive: u8,
    pub m_deleted: u8,
}
#[test]
fn bindgen_test_layout_lean_task_imp() {
    const UNINIT: ::core::mem::MaybeUninit<lean_task_imp> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lean_task_imp>(),
        32usize,
        concat!("Size of: ", stringify!(lean_task_imp))
    );
    assert_eq!(
        ::core::mem::align_of::<lean_task_imp>(),
        8usize,
        concat!("Alignment of ", stringify!(lean_task_imp))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_closure) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_task_imp),
            "::",
            stringify!(m_closure)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_head_dep) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_task_imp),
            "::",
            stringify!(m_head_dep)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_next_dep) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_task_imp),
            "::",
            stringify!(m_next_dep)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_prio) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_task_imp),
            "::",
            stringify!(m_prio)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_canceled) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_task_imp),
            "::",
            stringify!(m_canceled)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_keep_alive) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_task_imp),
            "::",
            stringify!(m_keep_alive)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_deleted) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_task_imp),
            "::",
            stringify!(m_deleted)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lean_task {
    pub m_header: lean_object,
    pub m_value: *mut lean_object,
    pub m_imp: *mut lean_task_imp,
}
#[test]
fn bindgen_test_layout_lean_task() {
    const UNINIT: ::core::mem::MaybeUninit<lean_task> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lean_task>(),
        24usize,
        concat!("Size of: ", stringify!(lean_task))
    );
    assert_eq!(
        ::core::mem::align_of::<lean_task>(),
        8usize,
        concat!("Alignment of ", stringify!(lean_task))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_task),
            "::",
            stringify!(m_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_task),
            "::",
            stringify!(m_value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_imp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_task),
            "::",
            stringify!(m_imp)
        )
    );
}
pub type lean_task_object = lean_task;
pub type lean_external_finalize_proc =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>;
pub type lean_external_foreach_proc = ::core::option::Option<
    unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void, arg2: b_lean_obj_arg),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lean_external_class {
    pub m_finalize: lean_external_finalize_proc,
    pub m_foreach: lean_external_foreach_proc,
}
#[test]
fn bindgen_test_layout_lean_external_class() {
    const UNINIT: ::core::mem::MaybeUninit<lean_external_class> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lean_external_class>(),
        16usize,
        concat!("Size of: ", stringify!(lean_external_class))
    );
    assert_eq!(
        ::core::mem::align_of::<lean_external_class>(),
        8usize,
        concat!("Alignment of ", stringify!(lean_external_class))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_finalize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_external_class),
            "::",
            stringify!(m_finalize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_foreach) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_external_class),
            "::",
            stringify!(m_foreach)
        )
    );
}
extern "C" {
    pub fn lean_register_external_class(
        arg1: lean_external_finalize_proc,
        arg2: lean_external_foreach_proc,
    ) -> *mut lean_external_class;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lean_external_object {
    pub m_header: lean_object,
    pub m_class: *mut lean_external_class,
    pub m_data: *mut ::core::ffi::c_void,
}
#[test]
fn bindgen_test_layout_lean_external_object() {
    const UNINIT: ::core::mem::MaybeUninit<lean_external_object> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lean_external_object>(),
        24usize,
        concat!("Size of: ", stringify!(lean_external_object))
    );
    assert_eq!(
        ::core::mem::align_of::<lean_external_object>(),
        8usize,
        concat!("Alignment of ", stringify!(lean_external_object))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_external_object),
            "::",
            stringify!(m_header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_class) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_external_object),
            "::",
            stringify!(m_class)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).m_data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lean_external_object),
            "::",
            stringify!(m_data)
        )
    );
}
extern "C" {
    #[link_name = "lean_is_scalar_rs_extern"]
    pub fn lean_is_scalar(o: *mut lean_object) -> bool;
}
extern "C" {
    #[link_name = "lean_box_rs_extern"]
    pub fn lean_box(n: usize) -> *mut lean_object;
}
extern "C" {
    #[link_name = "lean_unbox_rs_extern"]
    pub fn lean_unbox(o: *mut lean_object) -> usize;
}
extern "C" {
    pub fn lean_set_exit_on_panic(flag: bool);
}
extern "C" {
    pub fn lean_set_panic_messages(flag: bool);
}
extern "C" {
    pub fn lean_panic_fn(default_val: *mut lean_object, msg: *mut lean_object) -> *mut lean_object;
}
extern "C" {
    pub fn lean_internal_panic(msg: *const ::core::ffi::c_char) -> !;
}
extern "C" {
    pub fn lean_internal_panic_out_of_memory() -> !;
}
extern "C" {
    pub fn lean_internal_panic_unreachable() -> !;
}
extern "C" {
    pub fn lean_internal_panic_rc_overflow() -> !;
}
